import time
 
start_time = time.time()  # время начала выполнения

def linear_Search(list1, n, key): 
 
    for i in range(0, n): 
        if (list1[i] == key): 
            return i 
    return -1 
 
 
list1 = [1 ,3, 5, 7, 9, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 8, 9, 1 ,3, 5, 7, 9, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 8,1 ,3, 5, 
7, 9, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 8, 9, 1 ,3, 5, 7, 9, 3, 5, 6, 1, 5, 3, 1, 2, 6, 5, 7, 8, 1 ,3, 5, 7, 9, 3, 5, 6, 8,
5, 3, 1, 2, 6, 5, 7, 8, 9, 1 ,3, 5, 7, 2, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 8,1 ,3, 5, 5, 7, 8,
7, 9, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 8, 9, 1 ,3, 5, 7, 9, 3, 5, 6, 8, 5, 3, 1, 2, 6, 5, 7, 4,] 
key = 4 
 
n = len(list1) 
res = linear_Search(list1, n, key) 
if(res == -1): 
    print("Элемент на найден")
else: 
    print("Элемент найден под индексом: ", res)

end_time = time.time()  # время окончания выполнения
execution_time = end_time - start_time  # вычисляем время выполнения
print(f"Время выполнения программы: {execution_time} секунд")